
import { User } from '../types';

// Subset of users to ensure file validity.
const RAW_USER_DATA = `EmployeeName,EmployeeCode,MasterORGName
کاربر ارشد,admin,شرکت توسعه معدنی و صنعتی صبانور
کامران نوربخش,5276,واحد کنسانتره اسدآباد
حامد شرف پور,6596,واحد کنسانتره اسدآباد
زین العابدین میرزائی,6606,واحد کنسانتره اسدآباد
اسحاق تارمرادی,6607,واحد کنسانتره اسدآباد
احسان نادربیگی,6613,واحد کنسانتره اسدآباد
محمدجعفر کرمی,6622,واحد کنسانتره اسدآباد
محمد شیری مهذب,6631,واحد کنسانتره اسدآباد
اسماعیل عطایی,6686,واحد کنسانتره اسدآباد
بهروز سلطانی,6687,واحد کنسانتره اسدآباد
سجاد فلاح,6689,واحد کنسانتره اسدآباد
امیرحسین بنی آدم,7148,واحد کنسانتره اسدآباد
عباس مرادی,6692,واحد کنسانتره اسدآباد
شهرام مصباعی یارمرادی,6693,واحد کنسانتره اسدآباد
پیام فخیمی ذاکر,6694,واحد کنسانتره اسدآباد
جمال زارع,6695,واحد کنسانتره اسدآباد
اکبر سهیلی هدایتی,6696,واحد کنسانتره اسدآباد
امیر صفری,6697,واحد کنسانتره اسدآباد
مصطفی شیری مهذب,6698,واحد کنسانتره اسدآباد
مهدی نبی پور,6699,واحد کنسانتره اسدآباد
پرویز قاسمی حسن آباد,6700,واحد کنسانتره اسدآباد
علی حسن ایرانپور,6701,واحد کنسانتره اسدآباد
وحید لطفی,6703,واحد کنسانتره اسدآباد
محمد زارعی,6704,واحد کنسانتره اسدآباد
حسن مرادی پاکرو,6705,واحد کنسانتره اسدآباد
مهدی فدائی فر,6706,واحد کنسانتره اسدآباد
رسول عطائی مقدم,6707,واحد کنسانتره اسدآباد
سیدجواد حسینی,6708,واحد کنسانتره اسدآباد
مهراب فرجی,6709,واحد کنسانتره اسدآباد
حبیب شمسی حیدر,6710,واحد کنسانتره اسدآباد
حامد غنی پارسا,6711,واحد کنسانتره اسدآباد
مرتضی گوهری برزیده,6712,واحد کنسانتره اسدآباد
محمود مستوفی,6713,واحد کنسانتره اسدآباد
حسین حسن زاده,6714,واحد کنسانتره اسدآباد
بهمن عبدی,6715,واحد کنسانتره اسدآباد
شهریار ایرانپور,6716,واحد کنسانتره اسدآباد
عادل زارع,6717,واحد کنسانتره اسدآباد
سجاد فرهادی,6718,واحد کنسانتره اسدآباد
اصغر مرادی خوشبخت,6719,واحد کنسانتره اسدآباد
رسول معصومی,6720,واحد کنسانتره اسدآباد
حسن صادقی دیرین,6721,واحد کنسانتره اسدآباد
جواد جدی پاک,6722,واحد کنسانتره اسدآباد
فرشاد محمدیان حسن آباد,6723,واحد کنسانتره اسدآباد
اکبر عسگری,6724,واحد کنسانتره اسدآباد
جواد سرمدی گنجی,6725,واحد کنسانتره اسدآباد
هادی سبزیانی دلشاد,6726,واحد کنسانتره اسدآباد
عطاءاله کوهی,6727,واحد کنسانتره اسدآباد
محمدحسن حوریان,6728,واحد کنسانتره اسدآباد
قاسم پژمان,6729,واحد کنسانتره اسدآباد
مختار صدیقی,6731,واحد کنسانتره اسدآباد
محمد نرگسی خرم,6733,واحد کنسانتره اسدآباد
علی ابراهیمی,6734,واحد کنسانتره اسدآباد
عباس رضائی خو,6735,واحد کنسانتره اسدآباد
حسین وفائی,6736,واحد کنسانتره اسدآباد
هادی فعله گری,6737,واحد کنسانتره اسدآباد
سعید مرادی,6738,واحد کنسانتره اسدآباد
حامد محمودی,6739,واحد کنسانتره اسدآباد
غلامرضا رضائیان سیار,6741,واحد کنسانتره اسدآباد
مهدی زیوری روشن,6742,واحد کنسانتره اسدآباد
حسن سلیمانی,6743,واحد کنسانتره اسدآباد
سیدمصطفی محجوب,6744,واحد کنسانتره اسدآباد
سعید رحمتی فرود,6745,واحد کنسانتره اسدآباد
حسین حیدریان محب,6746,واحد کنسانتره اسدآباد
محسن کریمی,6747,واحد کنسانتره اسدآباد
کیوان حنیفی,6754,واحد کنسانتره اسدآباد
روزبه سهیلی هدایتی,6770,واحد کنسانتره اسدآباد
داریوش الطافی نعمت پور,6771,واحد کنسانتره اسدآباد
جلیل ورمزیاری,6772,واحد کنسانتره اسدآباد
سیدرضا موسوی,6773,واحد کنسانتره اسدآباد
علی اصغر فرجی,6774,واحد کنسانتره اسدآباد
محمود کریمی فرد,6775,واحد کنسانتره اسدآباد
محسن گوهری بهرامی,6776,واحد کنسانتره اسدآباد
حجت اله فرهمند نیک,6779,واحد کنسانتره اسدآباد
عبدالرضا بهمنی قایدی,6798,واحد کنسانتره اسدآباد
علیرضا مشایخی فر,6817,واحد کنسانتره اسدآباد
محمدامین عسگری نیا,6919,واحد کنسانتره اسدآباد
سعید عسکری,6947,واحد کنسانتره اسدآباد
سعید علائی,6961,واحد کنسانتره اسدآباد
بابک کریمی,7005,واحد کنسانتره اسدآباد
حسن نادریان شاد,7034,واحد کنسانتره اسدآباد
یاشار خدام,7044,واحد کنسانتره اسدآباد
نادر سوادی رستمی,7046,واحد کنسانتره اسدآباد
ادریس مرادی,7047,واحد کنسانتره اسدآباد
حبیب الله خالدیان,7049,واحد کنسانتره اسدآباد
علی مرادی,7050,واحد کنسانتره اسدآباد
محسن کلوندی,7051,واحد کنسانتره اسدآباد
جواد صفائی,7052,واحد کنسانتره اسدآباد
امیرعباس اقبالپور,7053,واحد کنسانتره اسدآباد
عبدالحمید خامنوی,7055,واحد کنسانتره اسدآباد
حسین مجاور شیخان,7061,واحد کنسانتره اسدآباد
محمدصدیق محمدپناه,7076,واحد کنسانتره اسدآباد
سیدیاسر سیدآقایی,7079,واحد کنسانتره اسدآباد
رامین حق محمدی,7094,واحد کنسانتره اسدآباد
میلاد سلیمانی,7095,واحد کنسانتره اسدآباد
علیرضا گودرزی,7096,واحد کنسانتره اسدآباد
مجتبی خوشسیما فرد,7097,واحد کنسانتره اسدآباد
عباس عزیزی,7098,واحد کنسانتره اسدآباد
میلاد خلجی,7117,واحد کنسانتره اسدآباد
علی نوری عنایت,7118,واحد کنسانتره اسدآباد
صادق فرحی,7119,واحد کنسانتره اسدآباد
عیسی سحاب امیرخانی,7120,واحد کنسانتره اسدآباد
اسماعیل فرجی,7123,واحد کنسانتره اسدآباد
علی خستو,7126,واحد کنسانتره اسدآباد
بهزاد صمدی,7128,واحد کنسانتره اسدآباد
اسحاق مروتی,7147,واحد کنسانتره اسدآباد
محمدرضا جمالی,7150,واحد کنسانتره اسدآباد
وحید سهرابی,7160,واحد کنسانتره اسدآباد
سمانه اسدی,7168,واحد کنسانتره اسدآباد
اصغر پاکنژاد مقدم,7176,واحد کنسانتره اسدآباد
محمدباقر زیوری منزه,7195,واحد کنسانتره اسدآباد
احسان رشیدی,7196,واحد کنسانتره اسدآباد
خداپرست جان الهی فرود,7197,واحد کنسانتره اسدآباد
ابوذر غفاری,7200,واحد کنسانتره اسدآباد
بابک احمدی,7205,واحد کنسانتره اسدآباد
محسن نوشادی,7210,واحد کنسانتره اسدآباد
علی اکبری متقی,7216,واحد کنسانتره اسدآباد
نبی الله سهرابی,7217,واحد کنسانتره اسدآباد
نادر بیاتی,7218,واحد کنسانتره اسدآباد
اصغر پاینده وحدت,7219,واحد کنسانتره اسدآباد
سجاد سهیلی مرادی ثمر,7220,واحد کنسانتره اسدآباد
مهران قره باغی,7221,واحد کنسانتره اسدآباد
فرشاد ملکی دستجرده,7223,واحد کنسانتره اسدآباد
کاووس کیمیایی فرد,7227,واحد کنسانتره اسدآباد
مهدی صباحی امجد,7228,واحد کنسانتره اسدآباد
سیداسماعیل حسینی,7230,واحد کنسانتره اسدآباد
سیدمیلاد سیدان حسینی اصل,7231,واحد کنسانتره اسدآباد
سامان حسن پور,7235,واحد کنسانتره اسدآباد
زاهد فیروزبهر,7236,واحد کنسانتره اسدآباد
مسعود فلاح,7237,واحد کنسانتره اسدآباد
سعید اکبرشاهی,7245,واحد کنسانتره اسدآباد
غلامرضا عابدی انور,7253,واحد کنسانتره اسدآباد
فرج الله بختیاری,7254,واحد کنسانتره اسدآباد
سعید حیدره,10278,واحد کنسانتره اسدآباد
امیر محمدی,8900138,واحد کنسانتره اسدآباد
بهروز واحدی شاد,8900139,واحد کنسانتره اسدآباد
وحید مهری,8900157,واحد کنسانتره اسدآباد
محمدرضا آریافر,8900158,واحد کنسانتره اسدآباد
جابر امیدی مشکوه,10113,واحد کنسانتره اسدآباد
حیدر شفیعی,8900162,واحد کنسانتره اسدآباد
ایمان پروا,8900165,واحد کنسانتره اسدآباد
محمدرضا کرمی,8900166,واحد کنسانتره اسدآباد
مهدی سرمدی حیدری,8900168,واحد کنسانتره اسدآباد
میثم وجدانی همت,8900193,واحد کنسانتره اسدآباد
فرهاد خدامرادی,10279,واحد کنسانتره اسدآباد
اصغر نجات بخش,10280,واحد کنسانتره اسدآباد
یدالله وفائی,6876,واحد کنسانتره اسدآباد
مسلم سیفی,6901,واحد کنسانتره اسدآباد
سعید سهرابی شهپر,10161,واحد کنسانتره اسدآباد
بهروز خالقی,8900131,واحد کنسانتره اسدآباد
حسین جعفری (پارسه),6361,واحد کنسانتره اسدآباد
جمشید ملایی,6889,واحد کنسانتره اسدآباد
اسماعیل وفائی بذل,6978,واحد کنسانتره اسدآباد
سعید ابرار علیزاده,7116,واحد کنسانتره اسدآباد
میرآقا فرحی,7142,واحد کنسانتره اسدآباد
رضا شاهمرادی,7209,واحد کنسانتره اسدآباد
علی اصغر مرادیان,7222,واحد کنسانتره اسدآباد
مسعود دولت پناه جولندان,7265,واحد کنسانتره اسدآباد
هادی یوسفی نوین,7266,واحد کنسانتره اسدآباد
حسین رضائیان سیار,7267,واحد کنسانتره اسدآباد
نادر مهرآفرین,7272,واحد کنسانتره اسدآباد
پیمان فیروزی هنرمند,7273,واحد کنسانتره اسدآباد
طاها احمدوند,7279,واحد کنسانتره اسدآباد
مژگان مرادنیا,888888881,واحد کنسانتره اسدآباد
ساسان صادقی,10052,واحد کنسانتره اسدآباد
احمدرضا زارعی,10085,واحد کنسانتره اسدآباد
جعفر زیوری مشفق,10107,واحد کنسانتره اسدآباد
اسحاق ظفری وحید,10160,واحد کنسانتره اسدآباد
حسن نیک پرور,10163,واحد کنسانتره اسدآباد
جواد صدیقی شایسته,10165,واحد کنسانتره اسدآباد
پژمان تاریمرادی,10167,واحد کنسانتره اسدآباد
جلیل سهرابی,10168,واحد کنسانتره اسدآباد
اسدالله نعمتی اجلالیه,10179,واحد کنسانتره اسدآباد
امیرحسین صادقی,10184,واحد کنسانتره اسدآباد
رضا فیروزی,10185,واحد کنسانتره اسدآباد
محمود فرازیان پاک,10267,واحد کنسانتره اسدآباد
میثم یاورنژاد اصل,10272,واحد کنسانتره اسدآباد
محمد قاسمی گل,10273,واحد کنسانتره اسدآباد
مصطفی بهرامی,10274,واحد کنسانتره اسدآباد
سعید حسنی مصباح,10276,واحد کنسانتره اسدآباد
علی احمدیان,10282,واحد کنسانتره اسدآباد
افشار جعفری بدخشان,10283,واحد کنسانتره اسدآباد
عادل ترابیان,10285,واحد کنسانتره اسدآباد
غلامعلی فیض الله خانی,10286,واحد کنسانتره اسدآباد
حامد خالوندی ایل ذوله,10287,واحد کنسانتره اسدآباد
حسین چراغی,10291,واحد کنسانتره اسدآباد
اشکان عابدی حسن کهل,10312,واحد کنسانتره اسدآباد
مهدی زبرجدی لطف,10314,واحد کنسانتره اسدآباد
محمود رشیدی,10317,واحد کنسانتره اسدآباد
امیرحسین کریمیان زاده,10417,واحد کنسانتره اسدآباد
زهرا معصومی,10423,واحد کنسانتره اسدآباد
الهام صالحی,10424,واحد کنسانتره اسدآباد
میلاد مختاری جونقانی,10425,واحد کنسانتره اسدآباد
مصطفی کاویانی مقدس,10426,واحد کنسانتره اسدآباد
مهدی جلیلی,10427,واحد کنسانتره اسدآباد
رضا مرادی,10428,واحد کنسانتره اسدآباد
علی صدیقی افخم,10429,واحد کنسانتره اسدآباد
ابوالفضل آزادی,10430,واحد کنسانتره اسدآباد
سیدحمید حسینی,10432,واحد کنسانتره اسدآباد
سجاد قاسمی حسن آباد,10433,واحد کنسانتره اسدآباد
پیمان شکری,10434,واحد کنسانتره اسدآباد
محمدجواد نجفی,10435,واحد کنسانتره اسدآباد
حمدالله سهرابی,10436,واحد کنسانتره اسدآباد
محمدعلی گلزار صفائی,10437,واحد کنسانتره اسدآباد
ابراهیم مرادی پور,10460,واحد کنسانتره اسدآباد
محمد نبی زاده,10461,واحد کنسانتره اسدآباد
احسان انصاری اختر,10462,واحد کنسانتره اسدآباد
محمد هادی باش باغی,10463,واحد کنسانتره اسدآباد
حسن امانی جمالی,10464,واحد کنسانتره اسدآباد
داوود حیدری کیا,10465,واحد کنسانتره اسدآباد
سیدمهدی معروفی,888888882,واحد کنسانتره اسدآباد
سجاد عبدی فر,888888883,واحد کنسانتره اسدآباد
کیومرث فعلی,10476,واحد کنسانتره اسدآباد
سعید  مرادی فخر,888888885,واحد کنسانتره اسدآباد
حمیدرضا میمنت آبادی,888888886,واحد کنسانتره اسدآباد
علی نامور,888888887,واحد کنسانتره اسدآباد
محسن مرادحاصلی,6921,واحد کنسانتره اسدآباد
رضا جمور,10511,واحد کنسانتره اسدآباد
امید جدی بصیر,10512,واحد کنسانتره اسدآباد
میلاد زارعی توحیدی,1111,واحد کنسانتره اسدآباد
ایمان محمدی,2094,واحد کنسانتره اسدآباد
بابک سهرابیان,0,واحد کنسانتره اسدآباد
مصطفی سهرابی,10684,واحد کنسانتره اسدآباد
صادق مرادی,10682,واحد کنسانتره اسدآباد
سعید فرحی گویا,10683,واحد کنسانتره اسدآباد
محسن قنبری,7099,واحد کنسانتره اسدآباد
الیاس زائری,10515,واحد کنسانتره اسدآباد
امید احمدی,10516,واحد کنسانتره اسدآباد`;

const parseUsers = (csvData: string): User[] => {
  const users: User[] = [];
  const lines = csvData.trim().split('\n');
  const startIndex = lines[0].includes('EmployeeName') ? 1 : 0;

  for (let i = startIndex; i < lines.length; i++) {
    const line = lines[i].trim();
    if (!line) continue;

    const parts = line.split(',');
    if (parts.length >= 2) {
      const name = parts[0].trim();
      const code = parts[1].trim();
      const org = parts.length > 2 ? parts.slice(2).join(',').trim() : '';

      if (code) {
          users.push({ name, code, org });
      }
    }
  }
  return users;
};

export const USERS: User[] = parseUsers(RAW_USER_DATA);
